import os
from random import randint
import time
from sys import platform
import keyboard



def refresh():	
	if platform == "linux" or platform == "linux2":
	    os.system('clear')
	elif platform == "darwin":
	    os.system('clear')
	elif platform == "win32":
	    os.system('cls')



def btn_escape():
		refresh()
		input('Главное меню')

def start_game():
	refresh()
	keyboard.press('backspace')
	print("__________________________________________________________________________________________________________________")
	print("___                                                                _______________________________________________")
	print("___   ЭТАП : ЗАГАДКА | Загадайте любое четырёхзначное число ^_^    _______________________________________________")
	print("__________________________________________________________________________________________________________________")
	mystery_user = input("> > > ВАШЕ ЧИСЛО : ")
	secret_mystery = list()
	

	print('- - - !!! ЗАПОМНИТЕ ВВЕДЕНОЕ ЧИСЛО, ЧЕРЕЗ 5 СЕКУНД СТРАНИЦА ПЕРЕЗАГРУЗИТСЯ !!! ')
	time.sleep(5)
	refresh()
	print("__________________________________________________________________________________________________________________")
	print("___                                                                _______________________________________________")
	print("___   ЭТАП : ПОПЫТКА | Попробуйте угадать введёное число ^_^       _______________________________________________")
	print("___   ПОДСКАЗКА : ОНО ЧЕТЫРЁХЗНАЧНОЕ 0_0                           _______________________________________________")
	print("__________________________________________________________________________________________________________________")

	secret_try = list()
	bulls = 0
	cows = 0
	flag = 0
			
	while flag == 0:
		try_user = input("> > >   ВАШЕ ЧИСЛО : ")

		for m in mystery_user.split():
			for symbol in m:
				secret_mystery.append(symbol)

		for i in try_user.split():
			for item in i:
				secret_try.append(item)
				
		if secret_try[0] in secret_mystery[0]:
			bulls +=1
		if secret_try[1] in secret_mystery[1]:
			bulls +=1
		if secret_try[2] in secret_mystery[2]:
			bulls +=1
		if secret_try[3] in secret_mystery[3]:
			bulls +=1

		if secret_try[0] in secret_mystery:
			cows +=1
		if secret_try[1] in secret_mystery:
			cows +=1
		if secret_try[2] in secret_mystery:
			cows +=1
		if secret_try[3] in secret_mystery:
			cows +=1 

		if try_user == mystery_user:
			print("Урааа, вы угадали, поздравляю!!!")
			flag = 1
		else:
			print("Выявлено быков :", bulls)
			print("Выявлено коров :", cows)
			print("Подумайте хорошенько что же это за число?")
			bulls = 0
			cows = 0
			secret_try.clear()
			secret_mystery.clear()

def rules():
	refresh()
	keyboard.press('backspace')
	print("\n   Игра 'Быки и коровы'\n")
	print("   У этой игры много разновидностей. Правила, по которым некоторые из нас играли в неё в детстве, такие.")
	print("  Кто-то загадывает последовательность из четырёх разных цифр. Она может начинаться с нуля. Назовём её «загадка».")
	print("  Отгадывающий называет последовательность, тоже состоящую из четырёх разных цифр. Назовём её «попытка».")
	print("  В ответ загадавший называет два числа:")
	print("  Сколько цифр, включённых в «попытку», есть в загадке, но стоят не на своих местах. Это количество коров.")
	print("  Например, если загадано число 3409, а «попытка» — это число 9480, то ответ такой: один бык, две коровы.") 
	print("  Отгадывающий повторяет попытки. \nЕго задача — отгадать исходную последовательность.")
	input(" \n\n  НАЖМИТЕ ENTER ЧТОБЫ ПЕРЕЙТИ К ИГРЕ")
	start_game()

def main_menu():
	print("__________________________________________________________________________________________________________________")
	print("__________________________________________________________________________________________________________________")
	print("__________________________________________________________________________________________________________________")
	print("__________________________________________________________________________________________________________________")
	print("___████__█____█__█__█__█___█_____█___█_____█__█__████__████__████__████__█____█___________________________________")   
	print("___█_____█____█__█_█___█__██_____█__██_____█_█___█__█__█__█__█__█__█__█__█____█___________________________________")
	print("___████__████_█__██____█_█_█_____█_█_█_____██____█__█__████__█__█__███___████_█___________________________________")
	print("___█__█__█__█_█__█_█___██__█_____██__█_____█_█___█__█__█_____█__█__█__█__█__█_█___________________________________")
	print("___████__████_█__█__█__█___█_____█___█_____█__█__████__█_____████__████__████_█___________________________________")
	print("__________________________________________________________________________________________________________________")
	print("__                                                                 _______________________________________________")
	print("__    [ A ] Начать игру                                            _______________________________________________")
	print("__    [ B ] Правила                                                _______________________________________________")
	print("__                                                                 _______________________________________________")
	print("__  ПРИМЕЧАНИЕ : Выбор производится исключительно нажатием клавиш  _______________________________________________")
	print("__                                                                 _______________________________________________")
	print("__  ВЕРСИЯ КЛИЕНТА : -1-2-945-classic-source-                      _______________________________________________")
	print("__                                                                 _______________________________________________")
	print("__  ТИП ОПЕРАЦИОННОЙ СИСТЕМЫ :", platform, "                              _______________________________________________")
	print("__                                                                 _______________________________________________")
	print("__  НИК СОЗДАТЕЛЯ : Lux3                                            _______________________________________________")
	print("__                                                                 _______________________________________________")
	print("__  НИК КОМАНДЫ : C0d3_off                                         _______________________________________________")
	print("__________________________________________________________________________________________________________________")
	print("__________________________________________________________________________________________________________________")
	print("__________________________________________________________________________________________________________________")
	keyboard.add_hotkey('A', start_game)
	keyboard.add_hotkey('B', rules)
	keyboard.wait()

main_menu()
input()
